---
kind: method
id: M:Autodesk.Revit.DB.ModelCurveArrayIterator.#ctor
source: html/d7bd9392-9aab-ae59-22ba-7d06b96714c4.htm
---
# Autodesk.Revit.DB.ModelCurveArrayIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public ModelCurveArrayIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.